// src/pages/About.js

import React from "react";
import "./styleComp.css";

function About() {
  return (
    <div className="about-container">
      <h2>عن الموقع</h2>
      <p>
        مرحبًا بكم في موقع تأجير المزارع، المنصة المثالية لكل من يبحث عن مكان
        هادئ ومميز لقضاء الوقت مع العائلة والأصدقاء. يوفر الموقع سهولة الوصول
        إلى العديد من المزارع المتاحة للتأجير في جميع أنحاء الأردن، مما يتيح لكم
        اختيار الموقع المناسب وفقًا لمتطلباتكم وميزانيتكم.
      </p>
      <p>
        يتميز موقعنا بتوفير معلومات مفصلة حول كل مزرعة، تشمل الموقع، والسعر،
        والوصف، وصور عالية الجودة للمزرعة. سواء كنتم تبحثون عن مكان للنزهة
        العائلية، أو للاستجمام الشخصي، أو حتى للتخييم، ستجدون هنا مجموعة متنوعة
        من الخيارات.
      </p>
      <p>
        هدفنا هو توفير تجربة سهلة ومريحة للمستخدمين ولأصحاب المزارع على حد سواء،
        حيث يمكن لأصحاب المزارع عرض مزارعهم والإعلان عنها بطريقة بسيطة، بينما
        يمكن للمستأجرين الاطلاع على الخيارات وحجز المزارع بكل سهولة وأمان.
      </p>
    </div>
  );
}

export default About;
