// src/FarmsInfo.js

import React from "react";
import "./FarmsInfo.css";

const FarmsInfo = () => {
  return (
    <div className="farms-info">
      <h1>رؤية الموقع</h1>
      <p>
        رؤيتنا هي تمكين الأفراد من استكشاف أفضل المزارع وتأجيرها بكل سهولة ويسر.
        نسعى لتوفير حلول تربط بين أصحاب المزارع والمستأجرين في بيئة سهلة
        الاستخدام وآمنة. هدفنا هو تعزيز السياحة الزراعية وتوفير تجربة فريدة
        ومريحة للمستخدمين.
      </p>

      <h2>الحلول التي نقدمها</h2>
      <ul>
        <li>منصة متكاملة لعرض المزارع المتاحة للإيجار.</li>
        <li>واجهة مستخدم بسيطة تساعد في تسهيل عملية الاستئجار.</li>
        <li>اتصال مباشر وآمن بين أصحاب المزارع والمستأجرين.</li>
        <li>
          توفير معلومات شاملة حول المزارع لمساعدة المستخدمين في اتخاذ قرارات
          مدروسة.
        </li>
      </ul>
    </div>
  );
};

export default FarmsInfo;
